In [6]:
import pandas as pd
data={"Date":["20.01.2025","21.01.2025","22.01.2025","23.01.2025","24.01.2025"],
      "Day": ["Monday","Tuesday","Wednesday","Thursday","Friday"],
      "Hours worked":[10,7,8,9,10],
      "Productivity":[3,4,5,5,2]}
df=pd.DataFrame(data)
print(df)
average=df["Productivity"].mean()
print(average)
#Class question

         Date        Day  Hours worked  Productivity
0  20.01.2025     Monday            10             3
1  21.01.2025    Tuesday             7             4
2  22.01.2025  Wednesday             8             5
3  23.01.2025   Thursday             9             5
4  24.01.2025     Friday            10             2
3.8

In [7]:
import pandas as pd
data={
    "Tid":[1,2,3,4,5,6,7,8,9,10],
    "Refund":["Yes","No","No","Yes","No","No","Yes","No","No","No"],
    "Marital Status":["Single","Married","Single","Married","Divorced","Married","Divorced","Single","Married","Single"],
    "Taxable income":[125000,100000,70000,120000,95000,60000,220000,85000,75000,90000],
    "Cheat":["No","No","No","No","Yes","No","No","Yes","No","Yes"]
}
df=pd.DataFrame(data)
print(df)

   Tid Refund Marital Status  Taxable income Cheat
0    1    Yes         Single          125000    No
1    2     No        Married          100000    No
2    3     No         Single           70000    No
3    4    Yes        Married          120000    No
4    5     No       Divorced           95000   Yes
5    6     No        Married           60000    No
6    7    Yes       Divorced          220000    No
7    8     No         Single           85000   Yes
8    9     No        Married           75000    No
9   10     No         Single           90000   Yes

In [8]:
print(df.iloc[[0,4,7,8]])

   Tid Refund Marital Status  Taxable income Cheat
0    1    Yes         Single          125000    No
4    5     No       Divorced           95000   Yes
7    8     No         Single           85000   Yes
8    9     No        Married           75000    No

In [9]:
#3(1)
print(df.iloc[3:7])

   Tid Refund Marital Status  Taxable income Cheat
3    4    Yes        Married          120000    No
4    5     No       Divorced           95000   Yes
5    6     No        Married           60000    No
6    7    Yes       Divorced          220000    No

In [10]:
#3(2)
print(df.iloc[4:8,2:4])#without including 8th row and 4th column
print("----------------------------------------------------------------------")
print(df.iloc[4:9,2:5])#with 8th row and 4th column

  Marital Status  Taxable income
4       Divorced           95000
5        Married           60000
6       Divorced          220000
7         Single           85000
----------------------------------------------------------------------
  Marital Status  Taxable income Cheat
4       Divorced           95000   Yes
5        Married           60000    No
6       Divorced          220000    No
7         Single           85000   Yes
8        Married           75000    No

In [11]:
#3(3)
print(df.iloc[0:,1:4])

  Refund Marital Status  Taxable income
0    Yes         Single          125000
1     No        Married          100000
2     No         Single           70000
3    Yes        Married          120000
4     No       Divorced           95000
5     No        Married           60000
6    Yes       Divorced          220000
7     No         Single           85000
8     No        Married           75000
9     No         Single           90000

In [12]:
df_csv=pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv')
print(df_csv.head())

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [16]:
df_modified = df_csv.drop(index=3).drop(columns=df_csv.columns[2])
print("Modified DataFrame:")
print(df_modified)

Modified DataFrame:
     sepal_length  sepal_width  petal_width    species
0             5.1          3.5          0.2     setosa
1             4.9          3.0          0.2     setosa
2             4.7          3.2          0.2     setosa
4             5.0          3.6          0.2     setosa
5             5.4          3.9          0.4     setosa
..            ...          ...          ...        ...
145           6.7          3.0          2.3  virginica
146           6.3          2.5          1.9  virginica
147           6.5          3.0          2.0  virginica
148           6.2          3.4          2.3  virginica
149           5.9          3.0          1.8  virginica

[149 rows x 4 columns]

In [18]:
import pandas as pd
data={
    "Employee_ID":[101,102,103,104,105],
    "Name":["Alice","Bob","Charlie","Diana","Edward"],
    "Department":["HR","IT","IT","Marketing","Sales"],
    "Age":[29,34,41,28,38],
    "Salary":[50000,70000,65000,55000,60000],
    "Years of Experience":[4,8,10,3,12],
    "Joining_Date":["2020-03-15","2017-07-19","2013-06-01","2021-02-10","2010-11-25"],
    "Gender":["Female","Male","Male","Female","Male"],
    "Bonus":[5000,7000,6000,4500,5000],
    "Rating":[4.5,4.0,3.8,4.7,3.5]
}
df=pd.DataFrame(data)
print(df)

   Employee_ID     Name Department  Age  Salary  Years of Experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
0   2020-03-15  Female   5000     4.5
1   2017-07-19    Male   7000     4.0
2   2013-06-01    Male   6000     3.8
3   2021-02-10  Female   4500     4.7
4   2010-11-25    Male   5000     3.5

In [19]:
#Q6(a)
print("Shape : ",df.shape)

Shape :  (5, 10)

In [23]:
#6(b)
print("Summary of the Dataframe:")
print(df.info())

Summary of the Dataframe:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Employee_ID          5 non-null      int64
 1   Name                 5 non-null      object
 2   Department           5 non-null      object
 3   Age                  5 non-null      int64
 4   Salary               5 non-null      int64
 5   Years of Experience  5 non-null      int64
 6   Joining_Date         5 non-null      object
 7   Gender               5 non-null      object
 8   Bonus                5 non-null      int64
 9   Rating               5 non-null      float64
dtypes: float64(1), int64(5), object(4)
memory usage: 532.0+ bytes
None

In [22]:
#6(c)
print("Descriptive Statistics:")
print(df.describe())

Descriptive Statistics:
       Employee_ID        Age       Salary  Years of Experience   Bonus  \
count     5.000000   5.000000      5.00000             5.000000     5.0
mean    103.000000  34.000000  60000.00000             7.400000  5500.0
std       1.581139   5.612486   7905.69415             3.847077  1000.0
min     101.000000  28.000000  50000.00000             3.000000  4500.0
25%     102.000000  29.000000  55000.00000             4.000000  5000.0
50%     103.000000  34.000000  60000.00000             8.000000  5000.0
75%     104.000000  38.000000  65000.00000            10.000000  6000.0
max     105.000000  41.000000  70000.00000            12.000000  7000.0

         Rating
count  5.000000
mean   4.100000
std    0.494975
min    3.500000
25%    3.800000
50%    4.000000
75%    4.500000
max    4.700000

In [26]:
#6(d)
#first five rows
print("First Five Rows:")
print(df.head())#print(df.iloc[0:5])
#last three rows
print("Last Three Rows:")
print(df.tail(3))#print(df.iloc[2:5])

First Five Rows:
   Employee_ID     Name Department  Age  Salary  Years of Experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
0   2020-03-15  Female   5000     4.5
1   2017-07-19    Male   7000     4.0
2   2013-06-01    Male   6000     3.8
3   2021-02-10  Female   4500     4.7
4   2010-11-25    Male   5000     3.5
Last Three Rows:
   Employee_ID     Name Department  Age  Salary  Years of Experience  \
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
2   2013-06-01    Male   6000     3.8
3   2021-02-10  Female   4500     4.7
4   2010-11-25    Male   5000     3.5

In [27]:
#6(e)
#(i) Average salary of employees
print("Average Salary of Employees:")
print(df["Salary"].mean())
#(ii)Total bonus
print("Total Bonus:", df["Bonus"].sum())
#(iii)Youngest employee
print("Youngest Employee Age:", df["Age"].min())
#(iv)Employee with highest rating
print("Highest Rating:", df["Rating"].max())

Average Salary of Employees:
60000.0
Total Bonus: 27500
Youngest Employee Age: 28
Highest Rating: 4.7

In [28]:
#6(f)
sorted_df=df.sort_values(by="Salary",ascending=False)
print("Sorted DataFrame:")
print(sorted_df)

Sorted DataFrame:
   Employee_ID     Name Department  Age  Salary  Years of Experience  \
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
4          105   Edward      Sales   38   60000                   12
3          104    Diana  Marketing   28   55000                    3
0          101    Alice         HR   29   50000                    4

  Joining_Date  Gender  Bonus  Rating
1   2017-07-19    Male   7000     4.0
2   2013-06-01    Male   6000     3.8
4   2010-11-25    Male   5000     3.5
3   2021-02-10  Female   4500     4.7
0   2020-03-15  Female   5000     4.5

In [29]:
#6(g)
df["Performance"] = pd.cut(df["Rating"],
bins=[0, 4.0, 4.5, 5],
labels=["Average", "Good", "Excellent"]
)
print(df[["Name", "Performance"]])

      Name Performance
0    Alice        Good
1      Bob     Average
2  Charlie     Average
3    Diana   Excellent
4   Edward     Average

In [31]:
#6(h)
print(df.isnull().sum())

Employee_ID            0
Name                   0
Department             0
Age                    0
Salary                 0
Years of Experience    0
Joining_Date           0
Gender                 0
Bonus                  0
Rating                 0
Performance            0
dtype: int64

In [32]:
#6(i)
df.rename(columns={"Employee_ID":"ID"},inplace=True)
print(df)

    ID     Name Department  Age  Salary  Years of Experience Joining_Date  \
0  101    Alice         HR   29   50000                    4   2020-03-15
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01
3  104    Diana  Marketing   28   55000                    3   2021-02-10
4  105   Edward      Sales   38   60000                   12   2010-11-25

   Gender  Bonus  Rating Performance
0  Female   5000     4.5        Good
1    Male   7000     4.0     Average
2    Male   6000     3.8     Average
3  Female   4500     4.7   Excellent
4    Male   5000     3.5     Average

In [36]:
#6(j)
new_df = df[(df["Years of Experience"] > 5) & (df["Department"] == "IT")]
print(new_df)

    ID     Name Department  Age  Salary  Years of Experience Joining_Date  \
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01

  Gender  Bonus  Rating Performance
1   Male   7000     4.0     Average
2   Male   6000     3.8     Average

In [37]:
#6(k)
df["Tax"] = df["Salary"] * 0.1
print(df)

    ID     Name Department  Age  Salary  Years of Experience Joining_Date  \
0  101    Alice         HR   29   50000                    4   2020-03-15
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01
3  104    Diana  Marketing   28   55000                    3   2021-02-10
4  105   Edward      Sales   38   60000                   12   2010-11-25

   Gender  Bonus  Rating Performance     Tax
0  Female   5000     4.5        Good  5000.0
1    Male   7000     4.0     Average  7000.0
2    Male   6000     3.8     Average  6500.0
3  Female   4500     4.7   Excellent  5500.0
4    Male   5000     3.5     Average  6000.0

In [38]:
df.to_csv("Our_Employees.csv", index=False)
print("DataFrame saved to 'Our_Employees.csv'")

DataFrame saved to 'Our_Employees.csv'